MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN512ZVLL10/mcu.h
#define ADSADDR                       0x1FFFFFFF80000000      // ADMA System Address
#define Reserved                      0x00000006      // - 
#define ADSADDR                       0x1FFFFFFF80000000      // ADMA System Address
#define Reserved                      0x00000006      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_VENDOR register.
//
//*****************************************************************************

#define EXBLKNU                       0x00000002      // Exact block number block read enable for SDIO CMD53
#define EXTDMAEN                      0x00000001      // External DMA Request Enable
#define Reserved                      0x780000000      // 
#define Reserved                      0x78000000      // 
#define INTSTVAL                      0x7F800000      // Internal State Value
#define Reserved                      0x1FFF8000      // 
#define EXBLKNU                       0x00000002      // Exact block number block read enable for SDIO CMD53
#define EXTDMAEN                      0x00000001      // External DMA Request Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_MMCBOOT register.
//
//*****************************************************************************

#define BOOTBLKCNT                    0x7FFF80000000      // The value defines the stop at block gap value of automatic mode. When received card block cnt is equal to BOOTBLKCNT and AUTOSABGEN is 1, then stop at block gap.
#define AUTOSABGEN                    0x00000080      // When boot, enable auto stop at block gap function. This function will be triggered, and host will stop at block gap when received card block cnt is equal to BOOTBLKCNT.
#define BOOTEN                        0x00000040      // Boot mode enable
#define BOOTMODE                      0x00000020      // Boot mode select
#define BOOTACK                       0x00000010      // Boot ack mode select
#define DTOCVACK                      0x00000078      // Boot ACK time out counter value.
#define BOOTBLKCNT                    0x7FFF80000000      // The value defines the stop at block gap value of automatic mode. When received card block cnt is equal to BOOTBLKCNT and AUTOSABGEN is 1, then stop at block gap.
#define Reserved                      0x007F8000      // 
#define AUTOSABGEN                    0x00000080      // When boot, enable auto stop at block gap function. This function will be triggered, and host will stop at block gap when received card block cnt is equal to BOOTBLKCNT.
#define BOOTEN                        0x00000040      // Boot mode enable
#define BOOTMODE                      0x00000020      // Boot mode select
#define BOOTACK                       0x00000010      // Boot ack mode select
#define DTOCVACK                      0x00000078      // Boot ACK time out counter value.


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_HOSTVER register.
//
//*****************************************************************************

#define VVN                           0x007F8000      // Vendor Version Number
#define SVN                           0x00007F80      // Specification Version Number
#define Reserved                      0x7FFF80000000      // 
#define VVN                           0x007F8000      // Vendor Version Number
#define SVN                           0x00007F80      // Specification Version Number


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_ATAG register.
//
//*****************************************************************************

#define ATAG                          0x7FFF8000      // AC97 Tag Value


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TMSK register.
//
//*****************************************************************************

#define TMSK                          0x7FFFFFFF80000000      // Transmit Mask


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_RMSK register.
//
//*****************************************************************************

#define RMSK                          0x7FFFFFFF80000000      // Receive Mask


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_ACCST register.
//
//*****************************************************************************

#define ACCST                         0x0007FE00      // AC97 Channel Status


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_ACCEN register.
//
//*****************************************************************************

#define ACCEN                         0x0007FE00      // AC97 Channel Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_ACCDIS register.
//
//*****************************************************************************

#define ACCDIS                        0x0007FE00      // AC97 Channel Disable


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PDOR register.
//
//*****************************************************************************

#define PDO                           0x7FFFFFFF80000000      // Port Data Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PSOR register.
//
//*****************************************************************************

#define PTSO                          0x7FFFFFFF80000000      // Port Set Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PCOR register.
//
//*****************************************************************************

